In [3]:
import pandas as pd

# Series

In [4]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index = index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [92]:
ser[0], ser['a'] #숫자, 우리가 지정한 인덱스로 꺼내기 가능 (둘 다 사용 가능)

C:\Users\Admin\AppData\Local\Temp\ipykernel_20128\3906807915.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a'] #숫자, 우리가 지정한 인덱스로 꺼내기 가능 (둘 다 사용 가능)

(np.int64(1), np.int64(1))

In [11]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
s3 = pd.Series(dict_data)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
ser2 = pd.Series([10,'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [ ]:
population = pd.Series([9776, 2729, 1566, 3158], index = ['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택 - 팬시인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [17]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [23]:
#ser[0], ser['a']
print(ser.iloc[0]) # 숫자 인덱스로 꺼냄
ser.loc['a'] # 인덱스 이름으로 꺼냄

1

np.int64(1)

# DataFrame

In [26]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [27]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [28]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [93]:
scientists['Name'] #시리즈

Rosaline Franklin    Rosaline Franklin
William Gosset          William Gosset
Name: Name, dtype: object

In [30]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [31]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [ ]:
# 인덱스로 행 추출
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [ ]:
#[행, 열] 인덱싱
scientists.loc['William Gosset', 'Born']

'1876-06-13'

In [96]:
# [시작행: 끝행, 시작열: 끝열]
# 쉼표는 행과 열 => 차원을 구분

scientists.iloc[:,0:2]

                                Name    Occupation
Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset        William Gosset  Statistician

In [34]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [50]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [51]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [37]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index = ['ㄱ', 'ㄴ', 'ㄷ'])
print(df)

   A  B  C
ㄱ  1  2  3
ㄴ  4  5  6
ㄷ  7  8  9

In [46]:
df.loc['ㄱ']

A    1
B    2
C    3
Name: ㄱ, dtype: int64

In [49]:
df.iloc[1]

A    4
B    5
C    6
Name: ㄴ, dtype: int64

In [100]:
sci1= pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 데이터 미리보기

In [54]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [ ]:
sci1.loc[0,'Name'] #[row, col] 인덱싱

'Rosaline Franklin'

In [103]:
#iloc로 william gosset의 나이 출력
print(sci1.iloc[1,4])

61

In [ ]:
#born, died 만 추출
print(sci1.iloc[:,2:4])

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [107]:
#occupation만 추출
print(sci1.iloc[:,1])

# 강사님 답
# sci1.loc[:, 'Occupation']

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [56]:
sci1.loc[0,'Occupation']

'Chemist'

In [58]:
sci1.to_csv('./data/scientist_1.csv')

In [ ]:
sci1.to_csv('./data/scientist_2.csv', index=False) #인덱스 포함 X

In [67]:
# pickle: 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientists.pickle')

In [69]:
df2 = pd.read_pickle('./data/scientists.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [60]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [63]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [70]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [ ]:
df1.head(3) #default = 5

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [74]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [75]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [78]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [81]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [4]:
# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [ ]:
# 처음 5개 행 보기
df.head() #head()는 기본이 5개

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

In [85]:
# 마지막 3개 행 보기
df.tail(3)

    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [86]:
# 데이터프레임 기본 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [87]:
# 기술 통계량
df.describe

<bound method NDFrame.describe of     이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91>

In [88]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [123]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [124]:
# 컬럼 목록을 직접 변경 가능, 길이는 같음
df.columns = ['name', 'age', 'score']

In [125]:
df.shape

(7, 3)

In [126]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [129]:
# 일부 열의 이름 변경
df1 = df.rename(columns={'name':'Name','age':'Age'})

# 일부 행의 이름 변경
df2 = df.rename(index={'A':'a'})

df2

  name  age  score
a  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

# 행 / 열 추가

In [131]:
df.iloc[0]

name     김철수
age       25
score     85
Name: a, dtype: object

In [ ]:
df.iloc[0:2] #행단위 슬라이싱 -1

  name  age  score
a  김철수   25     85
B  이영희   28     92

In [ ]:
df.loc[0] #행단위는 iloc, 이름단위 loc

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [137]:
df[df['나이']>25]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [ ]:
# 점수>90인 행 추출
df[df['점수']>90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [5]:
# 새로운 행 추가는 loc [ ] 사용 => iloc [ ]는 에러뜸
df.loc[7]=['홍길동', 30, 70]
#df.iloc[8]=['김길동', 20, 99]
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [150]:
df.append(9, '박나래', 20, 50)

AttributeError: 'DataFrame' object has no attribute 'append'

In [15]:
#열추가
df['grade']=['A','B','C','D','E','F','G','H']
df

# 등급으로 열 이름 변경
df.rename(columns={'grade':'등급'}, inplace=True)
df

    이름  나이  점수 등급 등급 등급
0  김철수  25  85  A  A  A
1  이영희  28  92  B  B  B
2  박민수  22  78  C  C  C
3  정수진  31  95  D  D  D
4  최영호  27  88  E  E  E
5  한미래  24  73  F  F  F
6  윤지원  29  91  G  G  G
7  홍길동  30  70  H  H  H

In [17]:
df.insert(loc=1, column='s_id', value=['S001','S002','S003','S004','S005','S006','S007','S008'])
df

    이름  s_id  나이  점수 등급 등급 등급
0  김철수  S001  25  85  A  A  A
1  이영희  S002  28  92  B  B  B
2  박민수  S003  22  78  C  C  C
3  정수진  S004  31  95  D  D  D
4  최영호  S005  27  88  E  E  E
5  한미래  S006  24  73  F  F  F
6  윤지원  S007  29  91  G  G  G
7  홍길동  S008  30  70  H  H  H

In [ ]:
# 인덱스로 행 삭제
df1 = df.drop(0, axis=0) #inplace 속성대신 이렇게 할 수도 있음
df = df1

df

    이름  s_id  나이  점수 등급 등급 등급
1  이영희  S002  28  92  B  B  B
2  박민수  S003  22  78  C  C  C
3  정수진  S004  31  95  D  D  D
4  최영호  S005  27  88  E  E  E
5  한미래  S006  24  73  F  F  F
6  윤지원  S007  29  91  G  G  G
7  홍길동  S008  30  70  H  H  H

In [22]:
df.drop('등급', axis=1)

    이름  s_id  나이  점수
1  이영희  S002  28  92
2  박민수  S003  22  78
3  정수진  S004  31  95
4  최영호  S005  27  88
5  한미래  S006  24  73
6  윤지원  S007  29  91
7  홍길동  S008  30  70

In [25]:
df.iloc[:,4:6]

  등급 등급
1  B  B
2  C  C
3  D  D
4  E  E
5  F  F
6  G  G
7  H  H

In [28]:
df.drop(columns=df.columns[4])

    이름  s_id  나이  점수
1  이영희  S002  28  92
2  박민수  S003  22  78
3  정수진  S004  31  95
4  최영호  S005  27  88
5  한미래  S006  24  73
6  윤지원  S007  29  91
7  홍길동  S008  30  70

In [30]:
col_keep = [i for i in range(len(df.columns)) if i !=4]
df=df.iloc[:, col_keep]
df

    이름  s_id  나이  점수 등급 등급
1  이영희  S002  28  92  B  B
2  박민수  S003  22  78  C  C
3  정수진  S004  31  95  D  D
4  최영호  S005  27  88  E  E
5  한미래  S006  24  73  F  F
6  윤지원  S007  29  91  G  G
7  홍길동  S008  30  70  H  H

In [31]:
col_keep = [i for i in range(len(df.columns)) if i !=4]
df=df.iloc[:, col_keep]
df

    이름  s_id  나이  점수 등급
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [34]:
# 객체를 숫자형으로 변환
df = df.astype({'나이':int, '점수':float})
df

    이름  s_id  나이    점수 등급
1  이영희  S002  28  92.0  B
2  박민수  S003  22  78.0  C
3  정수진  S004  31  95.0  D
4  최영호  S005  27  88.0  E
5  한미래  S006  24  73.0  F
6  윤지원  S007  29  91.0  G
7  홍길동  S008  30  70.0  H

In [35]:
# 문자열로 변환
df['s_id']=df['s_id'].astype(str)
df

    이름  s_id  나이    점수 등급
1  이영희  S002  28  92.0  B
2  박민수  S003  22  78.0  C
3  정수진  S004  31  95.0  D
4  최영호  S005  27  88.0  E
5  한미래  S006  24  73.0  F
6  윤지원  S007  29  91.0  G
7  홍길동  S008  30  70.0  H

In [37]:
df.index

Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [39]:
df_new=df.set_index('s_id')
df_new

       이름  나이    점수 등급
s_id
S002  이영희  28  92.0  B
S003  박민수  22  78.0  C
S004  정수진  31  95.0  D
S005  최영호  27  88.0  E
S006  한미래  24  73.0  F
S007  윤지원  29  91.0  G
S008  홍길동  30  70.0  H

In [40]:
df_new.index

Index(['S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='s_id')

In [41]:
df_new.reset_index(inplace=True)
df_new

   s_id   이름  나이    점수 등급
0  S002  이영희  28  92.0  B
1  S003  박민수  22  78.0  C
2  S004  정수진  31  95.0  D
3  S005  최영호  27  88.0  E
4  S006  한미래  24  73.0  F
5  S007  윤지원  29  91.0  G
6  S008  홍길동  30  70.0  H

In [42]:
dr = pd.date_range('2025-06-01', periods=7)
dr

DatetimeIndex(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
               '2025-06-05', '2025-06-06', '2025-06-07'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df_new ['date']=dr

In [44]:
df_new

   s_id   이름  나이    점수 등급       date
0  S002  이영희  28  92.0  B 2025-06-01
1  S003  박민수  22  78.0  C 2025-06-02
2  S004  정수진  31  95.0  D 2025-06-03
3  S005  최영호  27  88.0  E 2025-06-04
4  S006  한미래  24  73.0  F 2025-06-05
5  S007  윤지원  29  91.0  G 2025-06-06
6  S008  홍길동  30  70.0  H 2025-06-07

In [45]:
df_new1=df_new.set_index('date')
df_new1

            s_id   이름  나이    점수 등급
date
2025-06-01  S002  이영희  28  92.0  B
2025-06-02  S003  박민수  22  78.0  C
2025-06-03  S004  정수진  31  95.0  D
2025-06-04  S005  최영호  27  88.0  E
2025-06-05  S006  한미래  24  73.0  F
2025-06-06  S007  윤지원  29  91.0  G
2025-06-07  S008  홍길동  30  70.0  H